{
  "setup": {
    "points": [
      {
        "startValue": 800,
        "fullName": "Character Points",
        "name": "Pts",
        "icon": "/icons/character-points.png"
      },
      {
        "startValue": 3,
        "fullName": "Skill Points",
        "name": "SkP",
        "icon": "/icons/skill-points.png"
      }
    ],
    "showGitLink": true,
    "altLink": "https://github.com/aronedwards91/CYOA-base",
    "altLinkText": "ExLink",
    "effectOrdering": ["Archetype", "Origin", "Allies", "Languages", "Items"]
  },
  "title": {
    "cyoaName": "Deep Forest CYOA",
    "tagline": "an Adventure",
    "author": "me",
    "version": "0.1"
  },
  "intro": {
    "title": "A dark shadow looms over are an already dangerous land, a hero must step up to guide these disunited lands to a new golden era",
    "introText": "Welcome, brave adventurer, as you stand at the crossroads of destiny. The winds howl through the endless forest canopy like a chorus of ancient spirits, their whispers weaving a tale of forgotten lore and bygone heroes. It is an age of darkness, when every village is but a faint flicker in the vast expanse of night, yet it may also be an era of rebirth for those brave enough to forge a new path. The Celtic fantasy world of DarkForest beckons you with its mystical forests, ancient ruins, and mythical creatures - will you answer the call, or shall these young lands plunge into ruin?",
    "subtitle": "You begin with 800 Choice Points, and 3 Skill Points, choose wisely",
    "baseImage": "/images/base-image.webp"
  },
  "choices": [
    {
      "title": "Character Archetype",
      "description": "The archetype from which your character descends",
      "style": "list",
      "choicesUnique": true,
      "maxChoices": 1,
      "applyToPlayerImage": true,
      "options": [
        {
          "title": "Human Hunter",
          "description": "Your rugged boots have traversed countless miles of wildwood, leaving nary a footprint but those of your prey. With quiver full of arrows at your back and trusty spear in hand, you stalk the shadows with stealth as quiet as night. Your knwledge of stealth and tracking was often employed by men of the law to aid in the search for outlaws.",
          "image": "/images/archetype-human-hunter.webp",
          "cost": [0, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Human Hunter"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Short Bow",
                "desc": "A hunter's shortbow, nimble and quick to fire"
              }
            }
          ]
        },
        {
          "title": "Human Warrior",
          "description": "You are a warrior forged in the crucible of combat, every scar and bruise telling the tale of your unwavering courage! Your armor bears the scars of countless battles, as does your heart. With sword at side and shield emblazoned with the emblem of your fallen comrades, you charge into fray like a storm unleashed upon the land! What legends will you forge in these untamed realms? Will it be one of valor, or perhaps of vengeance? The gods themselves seem to whisper tales of your exploits, don't they?. Your fearlessness in battle when destroying corrupted beasts of this land has made you an ally of those who stand aside the plane of death, granting you the capacity to speak the tongue of the deathwatch carrion crows.",
          "image": "/images/archetype-human-warrior.webp",
          "cost": [50, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Human Warrior"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Stout Shield",
                "desc": "A fine, hardy, shield, painted with family heraldry"
              }
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Battle Axe",
                "desc": "A heavy, well balanced warriors axe, worn, but still to be greatly feared"
              }
            },
            {
              "type": "list",
              "key": "Languages",
              "data": {
                "quantity": 1,
                "name": "Carrion Tongue",
                "desc": "The capacity to speak the tongue of crows"
              }
            }
          ]
        },
        {
          "title": "Human Wanderer",
          "description": "'The Wanderer stands tall on the desolate plain, their worn leather boots planted firmly in the dusty ground as if rooted like an ancient tree. The weathered canvas backpack slung over their shoulder seems to blend seamlessly into the environment, its faded colors mimicking the hues of the sun-scorched earth and sky above. A wispy beard fringes their chin, a wild tangle of gray that speaks more of wisdom gained than age claimed. And yet, despite this rugged appearance, there is an air of quiet confidence about them - like a still pond reflecting the serenity of its surroundings, they exude tranquility deep within. But it's not just who they are or what they've seen that sets them apart, but also the staff in hand: a gnarled, twisted wood that seems to hum with a power as ancient and wild as the earth itself.",
          "image": "/images/archetype-human-wanderer.webp",
          "cost": [0, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Human Wanderer"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Strange staff",
                "desc": "An old runed staff, hums with the energy strange powers"
              }
            }
          ]
        },
        {
          "title": "Human Druid",
          "description": "The Human Druid stands tall amidst the ancient forest, their bare feet rooted to the earth like tree trunks, as they raise 'Moonstone Chimes' towards the lunar orb hanging low in the sky. The soft silver tones of the chimes seem to resonate in harmony with the moon's gentle light, bathing them in a soothing glow that invigorates and rejuvenates their very being. With each delicate note, they channel the full force of the lunar energy into their body, thus energised, they serve as a beacon to guide lost travelers through treacherous landscapes, shining brightly under moonlight like a celestial pathfinder. Following hidden lanes reserved only for those that know the old ways, the druid travels safetly, safe from any beast natural to the land",
          "image": "/images/archetype-human-druid.webp",
          "cost": [0, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Human Druid"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Moonstone Chimes",
                "desc": "Six crystal disks each etched with ancient runes, guide the way through the old forests"
              }
            }
          ]
        },
        {
          "title": "Dwarf Guardian",
          "description": "At the very threshold of the ancient stronghold stands mighty dwarf, resplendant in plate, his stalwart form a bulwark against the unknown dangers lurking beyond. His battle-worn armor glints like polished granite beneath the flickering torchlight, each plate etched with runes that whisper tales of unyielding bravery and unwavering duty. At shoulder height, he wields his trusty shield  - a behemoth of darkwood adorned with silver bolts and the emblem of the dwarven clans. Upon its surface, ancient wisdom is inscribed in letters as bold as the first stories told by firelight: 'Let none pass who do not bear honor in their heart.' A stern gaze from eyes like polished jet surveys all who approach, challenging them to prove their worthiness before the gates of old earth secrets. The very ground beneath his feet seems solidified into a testament of unshakeable resolve - and so too does he embody that unyielding spirit of dwarven resilience.",
          "image": "/images/archetype-dwarf-guardian.webp",
          "cost": [50, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Dwarf Guardian"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Plate Armor",
                "desc": "Forged from the earth itself. It is as solid as ancient stone and nearly impenetrable to even the most determined foe"
              }
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Tower Shield",
                "desc": "A behemoth of darkwood adorned with silver bolts and the emblem of the dwarven clans. Rune carved."
              }
            }
          ]
        },
        {
          "title": "Dwarf Scout",
          "description": "Striding across the battle-scarred plains like a living embodiment of his people's unyielding resolve. His dark beard flows behind him like a river of night, its braids woven with the silver threads of countless tales told and secrets kept. A mischievous glint in his eye hints at the assassin within  - one who can slip unnoticed into the shadows or strike swift and silent as a thunderclap. But it is also the diplomat's charm that opens doors, smooths ruffled feathers, and weaves alliances that will weather any storm of war. For Grimgold wears many hats and plays them all with equal aplomb: master of disguise, master of death, and master of negotiation  - a true Renaissance dwarf of old earth wit and cunning.",
          "image": "/images/archetype-dwarf-scout.webp",
          "cost": [0, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Dwarf Scout"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Poisoned Dagger",
                "desc": "A tiny but deadly instrument forged from the darkest depths of the mines. Its poison seeps into the wounds like bitter regret"
              }
            }
          ]
        },
        {
          "title": "Dwarf Cleric",
          "description": "Stepping forth with all the authority of ancient earth beneath his feet, eyes aglow like embers of eternal flame illuminate the face of this devout cleric, ever ready to defend the innocent or lead them in fervent song of praise. At his side hangs his sacred tome, the revered 'Chronicles of Deep Earth', the sacred tome of their people's history and spiritual traditions. His voice booms like thunder from the mountains, shaking the very foundations of those who hear it  - a true shepherd of old earth' s faithful.",
          "image": "/images/archetype-dwarf-cleric.webp",
          "cost": [0, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Archetype",
              "data": "Dwarf Cleric"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Sacred Tome",
                "desc": "A leatherbound tome that was once held by a much revered prophet. Speaks of history and traditions"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Origin",
      "description": "The tale of your birth & childhood.",
      "style": "boxes",
      "choicesUnique": true,
      "maxChoices": 1,
      "options": [
        {
          "title": "Delarun - the Cave City",
          "description": "In the depths of the earth, the dwarven city of Delarun thrums with ancient power, its tunnels winding like veins through granite rock. Here, the stout-hearted folk forge their destiny amidst glittering crystals and precious metals. Yet beneath the surface, rival clans jostle for dominance in a struggle that echoes the very earth itself.",
          "image": "/images/origin-delarun.webp",
          "cost": [50, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Origin",
              "data": "Delarun - the Cave City"
            },
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Delarun Lantern",
                "desc": "Famed for their compact size & brigth light, it is a token of your childhood"
              }
            }
          ]
        },
        {
          "title": "The Looming Spires",
          "description": "Here, pilgrims journey to honor the god of harvests, whose blessings have long nurtured the nearby forests through times of famine and plenty. But amidst this tranquility, a crisis brews - a bitter feud between neighboring monasteries over faith's finer points threatens to spill blood on sacred grounds, amid it's high walls the hermitage of Gorruk holds fast to its dwarven traditions, and religious fervor is beginning to boil over into petty squabbles and skirmishes!",
          "image": "/images/origin-looming-spires.webp",
          "cost": [0, 0],
          "effects": [
            {
              "type": "uniqueString",
              "key": "Origin",
              "data": "The Looming Spires"
            }
          ]
        }
      ]
    },
    {
      "title": "Allies",
      "description": "Brothers sworn to your side, and who can be called upon in times of trouble",
      "style": "list",
      "choicesUnique": true,
      "maxChoices": 3,
      "options": [
        {
          "title": "Ragnar 'Thunderhammer' Erifson",
          "description": "A gruff, battle-scarred dwarf with a heart of gold beneath his prickly exterior! When he lets loose with his trusty warhammer, the very earth shakes and giants tremble - but only after he's had his morning ale and a good belly laugh! A loyal ally to count on in the heat of battle. Just don't get him started on his least favorite topic: bards. The mere mention sends him stomping off in a huff, muttering something about 'too many notes'.",
          "image": "/images/ally-ragnar.webp",
          "cost": [100, 0],
          "effects": [
            {
              "type": "list",
              "key": "Allies",
              "data": {
                "quantity": 1,
                "name": "Ragnar 'Mad Axe' Erifson",
                "desc": "A quiet man, quick to a powerful beserker rage. +cats, -bards"
              }
            }
          ]
        },
        {
          "title": "Karrick 'Steel' Olborn",
          "description": "A foul-mouthed human with a penchant for causing chaos! His battle tactics are as unpredictable as his next hangover, leaving enemies reeling from one wild swing to the next. Though his strategies may not always succeed... they never fail to entertain! Just don't expect him to lend you any of his famous 'Riot's Revenge' ale after a long day of pillaging - unless you're buying! As for romance, he has a soft spot for curvaceous beauty and isn't afraid to show it.",
          "image": "/images/ally-karrick.webp",
          "cost": [50, 0],
          "effects": [
            {
              "type": "list",
              "key": "Allies",
              "data": {
                "quantity": 1,
                "name": "Karrick 'Steel' Olborn",
                "desc": "Grumpy dwarven drunkard, cunning, if dangerous planner. +chubby ladies, -sheriffs"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Items",
      "description": "The right equipment can keep you alive when the tide turns against you.",
      "style": "boxes",
      "choicesUnique": false,
      "maxChoices": 10,
      "options": [
        {
          "title": "Elixir of heaven's dew",
          "description": "A misty but radiant, honey colored brew infused with the essence of dawn flowers and blessed by the morning sun goddess. Drink deep and let healing energies course through your veins - the perfect remedy for those seeking to cheat mortal fate! Just be warned, it' might just leave you feeling a bit too peppy come nightfall.",
          "image": "/images/item-elixir.webp",
          "cost": [100, 0],
          "effects": [
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Elixir of heaven's dew",
                "desc": "Honey potion, cures mortal wounds over 3 days"
              }
            }
          ]
        },
        {
          "title": "Mechanical Talisman",
          "description": "An ornate amulet that whispers ominous warnings to its wearer, telling it's user of approaching dangers and which direction they are coming. Of little use beyond a mile, and inaccurate beyond a hundred yards",
          "image": "/images/item-talisman.webp",
          "cost": [100, 0],
          "unique": true,
          "effects": [
            {
              "type": "list",
              "key": "Items",
              "data": {
                "quantity": 1,
                "name": "Mechanical Talisman",
                "desc": "Indicates danger, and direction, though less accurate futher away, max range under a mile"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Skills",
      "description": "You are no ordinary man, your training has developed within you rare skills.",
      "style": "boxes",
      "choicesUnique": true,
      "maxChoices": 2,
      "options": [
        {
          "title": "Tactician",
          "description": "You have a powerful capacity for tactical thinking",
          "cost": [0, 2],
          "effects": [
            {
              "type": "list",
              "key": "skill",
              "data": {
                "quantity": 1,
                "name": "Tactician",
                "desc": "Seasoned and capable tactician"
              }
            }
          ]
        },{
          "title": "Druidic Shapeshifter",
          "description": "You have the capacity to change your form into that of a wolf or a bear",
          "cost": [0, 3],
          "effects": [
            {
              "type": "list",
              "key": "skill",
              "data": {
                "quantity": 1,
                "name": "Shapeshift",
                "desc": "Shapeshift between wolf and bear"
              }
            }
          ]
        }
      ]
    }
  ],
  "style": {
    "import": {
      "text": "https://fonts.googleapis.com/css2?family=Audiowide&family=Sedan+SC&display=swap"
    },
    "text": {
      "familyMain": "'Sedan SC', sans",
      "rootSize": "18px",
      "textColor": "#000"
    },
    "main": {
      "backgroundColor": "linear-gradient(61deg, rgba(73,101,1,1) -20%, rgba(92,123,20,1) 57%, rgba(2,60,64,1) 130%);",
      "textColor": "white",
      "cardColor": "#023C40",
      "cardBorderColor": "#2C3D01",
      "cardBorderRadius": "0.25rem",
      "cardBorderWidth": false,
      "boxBg": "#012527",
      "unselectionBorder": "1px solid transparent",
      "unselectionBg": "transparent",
      "unselectionBoxBorder": "1px solid black",
      "unselectionBoxBg": "#035E63",
      "selectionBorder": "1px solid #64CE9E",
      "selectionBg": "#012527",
      "imageBorder": "#496501"
    },
    "sidebar": {
      "backgroundColor": "linear-gradient(61deg, rgba(73,101,1,1) -20%, rgba(92,123,20,1) 57%, rgba(2,60,64,1) 130%);",
      "textColor": "white",
      "cardColor": "#023C40",
      "cardBorderColor": "#2C3D01",
      "cardBorderRadius": "0.25rem",
      "cardBorderWidth": false
    }
  }
}
